# Load oh-my-zsh library
getantidote/use-omz

# Load OMZ's lib for core utilities
ohmyzsh/ohmyzsh path:lib

# Load theme
ohmyzsh/ohmyzsh path:themes/fino-time.zsh-theme

# Load ohmyzsh plugins
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/dirhistory
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/safe-paste

# Load community plugins
zdharma-continuum/fast-syntax-highlighting
zsh-users/zsh-autosuggestions
